# coding:utf-8

from flask import Flask,request,render_template
from pathlib import Path
from flask import jsonify   # 区别于json.dumps()
import json					# json.dumps() 返回的是： Content-Type:text/html 
							# jsonify() 返回的是：Content-Type: application/json
from flask_cors import CORS
####mongoDB####
import pymongo,os
from fontSubset import fontCreate


app = Flask(__name__,static_url_path='')
cors = CORS(app,supports_credentials=True)
cwd = os.getcwd()
# mongodb 配置
client = pymongo.MongoClient('localhost',27017)
blunt = client['blunt']
poemers = blunt['authors']
bxcp = blunt['bxcp']
voteForWedding = blunt['tipForWedding']
_num = 12
poem ={
	"忆江南":{
		"词牌名": "忆江南",
		"作者": "李煜",
		"词谱": "021,21103.2120011,2021103,21103.",  # 0-平声/ 1-仄声/ 2-可平可仄/ 3-平韵/ 4-仄韵
		"词名": "怀旧",
		"词体":"多少恨，昨夜梦魂中。还似旧时游上苑，车如流水马如龙，花月正春风。"
		}
}

bxcpIndex = [{'No': 1, '词牌名': '菩萨蛮', '词名': '闺情', '作者': '李白'}, {'No': 2, '词牌名': '忆秦娥', '词名': '思秋', '作者': '李白'}, {'No': 3, '词牌名': '调笑令', '词名': '宫词', '作者': '王建'}, {'No': 4, '词牌名': '长相思', '词名': '别情', '作者': '白居易'}, {'No': 5, '词牌名': '更漏子', '词名': '本意', '作者': '温庭筠'}, {'No': 6, '词牌名': '摊破浣溪沙', '词名': '秋恨', '作者': '李�Z（南唐中主）'}, {'No': 7, '词牌名': '忆江南', '词名': '怀旧', '作者': '李煜（南唐后主）'}, {'No': 8, '词牌名': '捣练子', '词名': '秋闺', '作者': '李煜（南唐后主）'}, {'No': 9, '词牌名': '相见欢', '词名': '秋闺', '作者': '李煜（南唐后主）'}, {'No': 10, '词牌名': '浪淘沙', '词名': '怀旧', '作者': '李煜（南唐后主）'}, {'No': 11, '词牌名': '虞美人', '词名': '感旧', '作者': '李煜（南唐后主）'}, {'No': 12, '词牌名': '一斛珠', '词名': '香口', '作者': '李煜（南唐后主）'}, {'No': 13, '词牌名': '谒金门', '词名': '春闺', '作者': '冯延巳'}, {'No': 14, '词牌名': '踏莎行', '词名': '春暮', '作者': '寇准'}, {'No': 15, '词牌名': '贺圣朝', '词名': '留别', '作者': '叶清臣'}, {'No': 16, '词牌名': '御街行', '词名': '离怀', '作者': '范仲淹'}, {'No': 17, '词牌名': '渔家傲', '词名': '秋思', '作者': '范仲淹'}, {'No': 18, '词牌名': '苏幕遮', '词名': '怀旧', '作者': '范仲淹'}, {'No': 19, '词牌名': '锦缠道', '词名': '春游', '作者': '宋祈'}, {'No': 20, '词牌名': '离亭燕', '词名': '怀古', '作者': '张升'}, {'No': 21, '词牌名': '诉衷情', '词名': '眉意', '作者': '欧阳修'}, {'No': 22, '词牌名': '阮郎归', '词名': '踏青', '作者': '欧阳修'}, {'No': 23, '词牌名': '南歌子', '词名': '闺情', '作者': '欧阳修'}, {'No': 24, '词牌名': '临江仙', '词名': '妓席', '作者': '欧阳修'}, {'No': 25, '词牌名': '西江月', '词名': '佳人', '作者': '司马光'}, {'No': 26, '词牌名': '桂枝香', '词名': '金陵怀古', '作者': '王安石'}, {'No': 27, '词牌名': '天仙子', '词名': '送春', '作者': '张先'}, {'No': 28, '词牌名': '昼夜乐', '词名': '忆别', '作者': '柳永'}, {'No': 29, '词牌名': '雨淋铃', '词名': '秋别', '作者': '柳永'}, {'No': 30, '词牌名': '卜算子', '词名': '别意', '作者': '苏轼'}, {'No': 31, '词牌名': '洞仙歌', '词名': '夏夜', '作者': '苏轼'}, {'No': 32, '词牌名': '蝶恋花', '词名': '春景', '作者': '苏轼'}, {'No': 33, '词牌名': '水调歌头', '词名': '中秋', '作者': '苏轼'}, {'No': 34, '词牌名': '清平乐', '词名': '晚春', '作者': '黄庭坚'}, {'No': 35, '词牌名': '画堂春', '词名': '本意', '作者': '黄庭坚'}, {'No': 36, '词牌名': '蓦山溪', '词名': '别意', '作者': '黄庭坚'}, {'No': 37, '词牌名': '忆王孙', '词名': '春闺', '作者': '秦观'}, {'No': 38, '词牌名': '如梦令', '词名': '春景', '作者': '秦观'}, {'No': 39, '词牌名': '桃源忆故人', '词名': '冬景', '作者': '秦观'}, {'No': 40, '词牌名': '鹊桥仙', '词名': '七夕', '作者': '秦观'}, {'No': 41, '词牌名': '河传', '词名': '赠妓', '作者': '秦观'}, {'No': 42, '词牌名': '满庭芳', '词名': '春游', '作者': '秦观'}, {'No': 43, '词牌名': '清玉案', '词名': '春暮', '作者': '贺铸'}, {'No': 44, '词牌名': '薄幸', '词名': '春情', '作者': '贺铸'}, {'No': 45, '词牌名': '惜分飞', '词名': '本意', '作者': '毛滂'}, {'No': 46, '词牌名': '河满子', '词名': '秋怨', '作者': '孙洙'}, {'No': 47, '词牌名': '烛影摇红', '词名': '惜春', '作者': '王诜'}, {'No': 48, '词牌名': '减字木兰花', '词名': '春情', '作者': '王安国'}, {'No': 49, '词牌名': '千秋岁', '词名': '夏景', '作者': '谢逸'}, {'No': 50, '词牌名': '琐窗寒', '词名': '寒食', '作者': '周邦彦'}, {'No': 51, '词牌名': '解语花', '词名': '元宵', '作者': '周邦彦'}, {'No': 52, '词牌名': '过秦楼', '词名': '秋夜', '作者': '周邦彦'}, {'No': 53, '词牌名': '昭君怨', '词名': '春怨', '作者': '万俟雅言'}, {'No': 54, '词牌名': '感皇恩', '词名': '入京', '作者': '赵企'}, {'No': 55, '词牌名': '好事近', '词名': '初夏', '作者': '蒋子云'}, {'No': 56, '词牌名': '贺新郎', '词名': '春闺', '作者': '李玉'}, {'No': 57, '词牌名': '潇湘夜雨', '词名': '灯花', '作者': '赵长卿'}, {'No': 58, '词牌名': '祝英台近', '词名': '春晚', '作者': '辛弃疾'}, {'No': 59, '词牌名': '南浦', '词名': '春暮', '作者': '程垓'}, {'No': 60, '词牌名': '齐天乐', '词名': '蟋蟀', '作者': '姜夔'}, {'No': 61, '词牌名': '沁园春', '词名': '有感', '作者': '陆游'}, {'No': 62, '词牌名': '醉太平', '词名': '闺情', '作者': '刘过'}, {'No': 63, '词牌名': '喜迁莺', '词名': '闰元宵', '作者': '吴礼之'}, {'No': 64, '词牌名': '双双燕', '词名': '本意', '作者': '史达祖'}, {'No': 65, '词牌名': '换巢鸾凤', '词名': '春情', '作者': '史达祖'}, {'No': 66, '词牌名': '瑞鹤仙', '词名': '风怀', '作者': '史达祖'}, {'No': 67, '词牌名': '风入松', '词名': '春园', '作者': '吴文英'}, {'No': 68, '词牌名': '一翦梅', '词名': '春思', '作者': '蒋捷'}, {'No': 69, '词牌名': '永遇乐', '词名': '绿阴', '作者': '蒋捷'}, {'No': 70, '词牌名': '瑶台聚八仙', '词名': '寄兴', '作者': '张炎'}, {'No': 71, '词牌名': '水龙吟', '词名': '白莲', '作者': '张炎'}, {'No': 72, '词牌名': '绮罗香', '词名': '红叶', '作者': '张炎'}, {'No': 73, '词牌名': '疏影', '词名': '梅影', '作者': '张炎'}, {'No': 74, '词牌名': '采桑子', '词名': '春暮', '作者': '朱藻'}, {'No': 75, '词牌名': '荆州亭', '词名': '题柱', '作者': '吴城小龙女【此词题于荆州江亭柱上，故又名“江亭怨”，原本“清平乐令”。】'}, {'No': 76, '词牌名': '醉花阴', '词名': '重九', '作者': '李清照'}, {'No': 77, '词牌名': '凤凰台上忆吹箫', '词名': '别情', '作者': '李清照'}, {'No': 78, '词牌名': '声声慢', '词名': '秋情', '作者': '李清照'}, {'No': 79, '词牌名': '南乡子', '词名': '春闺', '作者': '孙道绚'}, {'No': 80, '词牌名': '生查子', '词名': '元夕', '作者': '朱淑真'}, {'No': 81, '词牌名': '鹧鸪天', '词名': '别情', '作者': '聂胜琼'}, {'No': 82, '词牌名': '人月圆', '词名': '有感', '作者': '吴激'}, {'No': 83, '词牌名': '望海潮', '词名': '凯旋舟次', '作者': '折元礼'}, {'No': 84, '词牌名': '玉漏迟', '词名': '咏怀', '作者': '元好问'}, {'No': 85, '词牌名': '点绛唇', '词名': '闺情', '作者': '曾允元'}, {'No': 86, '词牌名': '满江红', '词名': '金陵怀古', '作者': '萨都拉'}, {'No': 87, '词牌名': '念奴娇', '词名': '石头城', '作者': '萨都拉'}, {'No': 88, '词牌名': '陌上花', '词名': '有怀', '作者': '张翥'}, {'No': 89, '词牌名': '东风第一枝', '词名': '忆梅', '作者': '张翥'}, {'No': 90, '词牌名': '摸鱼儿', '词名': '送春', '作者': '张翥'}, {'No': 91, '词牌名': '多丽', '词名': '西湖', '作者': '张翥'}, {'No': 92, '词牌名': '夺锦标', '词名': '七夕', '作者': '张埜'}, {'No': 93, '词牌名': '眼儿媚', '词名': '秋闺', '作者': '刘基'}, {'No': 94, '词牌名': '误佳期', '词名': '闺怨', '作者': '汪懋麟'}, {'No': 95, '词牌名': '柳梢青', '词名': '纪游', '作者': '朱彝尊'}, {'No': 96, '词牌名': '解佩令', '词名': '自题词集', '作者': '朱彝尊'}, {'No': 97, '词牌名': '暗香', '词名': '咏红豆', '作者': '朱彝尊'}, {'No': 98, '词牌名': '庆春泽', '词名': '纪恨', '作者': '朱彝尊'}, {'No': 99, '词牌名': '春风袅娜', '词名': '游丝', '作者': '朱彝尊'}, {'No': 100, '词牌名': '翠楼吟', '词名': '魂', '作者': '黄之隽'}]

# font配置
fontClass = fontCreate(str(Path(cwd)/'static/font/mikai.woff'))


@app.route("/")
def index():
	
	return render_template('index.html')

@app.route("/bxcp")
def b():
	return render_template('bxcp.html')

@app.route("/mobile")
def mobile():
	return render_template("mobile.html")

@app.route("/search/<No>")
def search(No):
	cpBody = bxcp.find_one({"No":int(No)})
	cpBody.pop('_id')
	woffFile = "static/font/" + No + ".woff"
	if not os.path.isfile(str(Path(cwd)/woffFile)):
		text = '<木木诗词>《》白香词谱—第其壹贰叁肆伍陆柒捌玖拾佰'
		text += cpBody['词牌名'] +cpBody['词名']+cpBody['作者']
		for i,t in enumerate(cpBody['词体']):
			if i%2 == 0:
				text += t
		fontClass.woffCreate(text,No)
	return json.dumps(cpBody,ensure_ascii=False).encode('utf-8')

@app.route("/word",methods=['GET','POST'])
def word():
		
		data = request.get_json(silent=True)
		info = poem[data['name']] 
		
		return json.dumps(info)

@app.route('/bxcpIndex')
def test():
	return json.dumps(bxcpIndex,ensure_ascii=False).encode('utf-8')

@app.route("/invitation")
def invitation():
	return render_template('invitation.html')

@app.route("/getVoteDate/<message>")
def voteDeal(message):
	voteDates = []
	if message == "voteDate.json":
		voteDate = voteForWedding.find_one({"name":"新郎"})
		voteDate.pop("_id")
		voteDates.append(voteDate)
		voteDate = voteForWedding.find_one({"name":"新娘"})
		voteDate.pop("_id")
		voteDates.append(voteDate)
		return json.dumps(voteDates,ensure_ascii=False).encode('utf-8')
	else:
		sign = message.split(":")[0]
		IP = message.split(":")[1]
		if sign == "0":
			tempItemIP = voteForWedding.find_one({"name":"新郎"})["IP"]
			tempItemNum = voteForWedding.find_one({"name":"新郎"})["num"]
			tempItemIP.append(IP)
			voteForWedding.update_one({"name":"新郎"},{"$set":{"IP":tempItemIP,"num":tempItemNum+1}})
		else:
			tempItemIP = voteForWedding.find_one({"name":"新娘"})["IP"]
			tempItemNum = voteForWedding.find_one({"name":"新娘"})["num"]
			tempItemIP.append(IP)
			voteForWedding.update_one({"name":"新娘"},{"$set":{"IP":tempItemIP,"num":tempItemNum+1}})
		return "ok"

@app.route("/enroll/<enroll>")
def enroll(enroll):
	name = enroll.split(":")[0]
	tel = enroll.split(":")[1]
	tempEnroll = voteForWedding.find_one({"name":"登记"})["content"]
	tempEnroll[name] = tel
	voteForWedding.update_one({"name":"登记"},{"$set":{"content":tempEnroll}})
	return "ok"

app.run("0.0.0.0",80,debug=True)